Repository: blacksponge/zonemaster-gui
Catalog: src/locale/messages.*.xlf
Languages: fr

source: It depends on which test failed for your domain name. Each test is accompanied with one or several messages describing the issues found.
fr: Cela dépend du test ayant échoué pour votre nom de domaine. Chaque test est accompagné d'un ou plusieurs messages décrivant les problèmes qui ont été trouvés.

source: Zonemaster is a software package that validates the quality of a DNS delegation.
fr: Zonemaster est un logiciel qui valide la qualité d'une délégation DNS.

source: for IPv6 prefix '2001:db8::/32': 8.b.d.0.1.0.0.2.ip6.arpa.
fr: pour le préfixe IPv6 « 2001:db8::/32 » : 8.b.d.0.1.0.0.2.ip6.arpa.

source: for IPv4 prefix '198.51.100.0/24': 100.51.198.in-addr.arpa;
fr: pour le préfixe IPv4 « 198.51.100.0/24 » : 100.51.198.in-addr.arpa ;

source: There is a 10 minutes protection between consecutive tests for a given domain name, with same test parameters. Running a test within that window will instead show the last available test for that domain name, and parameters.
fr: Il y a une temporisation de dix minutes entre deux tests consécutifs d'un même nom de domaine, avec les mêmes paramètres de test. Lancer un second test dans cette fenêtre de temps donnera les résultats du dernier test effectué pour ce nom de domaine et ces paramètres, au lieu d'un nouveau test.

source: Example:
fr: Exemple :

source: Yes. By default Zonemaster will query name servers both over IPv4 and IPv6, unless explicitly configured otherwise. Such configuration is accessible through the "Options" button.
fr: Oui. Par défaut, Zonemaster interroge les serveurs de noms aussi bien en IPv4 qu'en IPv6, sauf si un paramètre de configuration prescrit le contraire. De tels paramètres de configuration sont accessibles en utilisant le bouton « Options ».

source: Zonemaster can be used to test <a href="#">undelegated domain names</a>.
fr: Zonemaster peut être utilisé pour tester des <a href="#">noms de domaines non délégués</a>.

source: Zonemaster is a joint project between <a i18n-href="Afnic link" href="https://www.afnic.fr/en/">AFNIC</a>, the registry of '.fr' TLD and several other TLDs like '.re', '.pm', '.tf', '.wf', '.yt' and '.paris', and <a i18n-href="IIS link" href="https://internetstiftelsen.se/en/">The Swedish Internet Foundation</a>, the registry of '.se' and '.nu' TLDs.
fr: Zonemaster est un projet conjoint entre <a i18n-href="Afnic link" href="https://www.afnic.fr/en/">l'Afnic</a>, registre du TLD « .fr » ainsi que d'autres TLD, comme « .re », « .pm », « .tf », « .wf », « .yt » et « .paris » et <a i18n-href="IIS link" href="https://internetstiftelsen.se/en/">The Swedish Internet Foundation</a>, registre des TLD « .se » et « .nu ».

source: How come my domain name cannot be tested?
fr: Pourquoi mon nom de domaine n'a-t-il pas pu être testé ?

source: The Zonemaster tool could help different kind of users:
fr: Zonemaster peut aider différents types d'utilisateurs et utilisatrices :

source: The descriptions of message levels such as notice, warning and error are found in Severity Level Definitions.
fr: Les descriptions de niveaux de messages comme notice, avertissement et erreur se trouvent dans le document de définition des niveaux de sévérité.

source: All tests that Zonemaster runs are defined in the Test Case Specification documents that can be found in the <a href="https://github.com/zonemaster/zonemaster/tree/master/docs/public/specifications/tests#zonemaster-test-case-specifications">Test Case Specification documents</a>
fr: Tous les tests qu'effectue Zonemaster sont définis dans des spécifications de cas de test, qui se trouvent dans les <a href="https://github.com/zonemaster/zonemaster/tree/master/docs/public/specifications/tests#zonemaster-test-case-specifications">documents de spécifications de cas de test (en anglais)</a>

source: What is an undelegated domain test?
fr: Qu'est-ce qu'un test sur un nom de domaine non délégué ?

source: Yes. Use the "Options" button and there add the Delegation Signer (DS) records to be tested. Zonemaster will then use those in the same way as if they were already added in the parent zone.
fr: Oui. Pour cela, utilisez le bouton « Options » et ajoutez-y les enregistrements DS à tester. Zonemaster utilisera ces entrées-là comme si elles avaient déjà été ajoutées dans la zone parente.

# ngb.alert.close
source: Close
fr: Fermer

# ngb.carousel.next
source: Next
fr: Suivant

# ngb.carousel.previous
source: Previous
fr: Précédent

# ngb.carousel.slide-number
source: Slide ** * If `tru of with carousel
fr: Diapositive ** * If `tru de with carousel

# ngb.timepicker.increment-seconds
source: Increment seconds
fr: Incrémenter les secondes

# ngb.timepicker.seconds
source: Seconds
fr: Secondes

# ngb.toast.close-aria
source: Close
fr: Fermer

source: https://www.afnic.fr/en/
fr: https://www.afnic.fr

source: (optional)
fr: (facultatif)

source: The message means something that should be known by the zone's administrator but that need not necessarily be a problem at all.
fr: Le message indique un élément dont la personne administrant la zone devrait prendre connaissance sans qu’il ne s’agisse nécessairement d’un problème de configuration.

source: The message is something that may be of interest to the zone's administrator but that definitely does not indicate a problem.
fr: Le message indique une information pouvant être utile pour la personne administrant la zone, mais qui n’est en aucun cas une anomalie.

source: The message means something that will under some circumstances be a problem, but that is unlikely to be noticed by a casual user.
fr: Le message indique un élément pouvant causer un dysfonctionnement dans certaines circonstances, mais qu’une personne non avertie a peu de chances de repérer.

source: Address
fr: Adresse

source: What is the meaning of the severity levels?
fr: Que signifie les niveaux de sévérité ?

source: The message means a problem that is very likely (or possibly certain) to negatively affect the function of the zone being tested, but not so severe that the entire zone becomes unresolvable.
fr: Le message indique une anomalie pouvant provoquer de façon (quasi) certaine un dysfonctionnement de la zone testée, sans être suffisamment grave pour rendre l’intégralité de la zone inaccessible.

source: Search text in messages
fr: Rechercher dans les messages

source: The message means a very serious error.
fr: Le message indique une erreur très grave.

source: Fetch nameservers from parent zone
fr: Récupérer les serveurs de noms depuis la zone parente

source: https://en.wikipedia.org/wiki/Request_for_Comments
fr: https://fr.wikipedia.org/wiki/Request_for_comments

source: Expand all modules
fr: Déplier tous les modules
