Repository: blacksponge/zonemaster-gui
Catalog: src/locale/messages.*.xlf
Languages: fr

source: Close
fr: Fermer

source: What is an undelegated domain test?
fr: Qu'est-ce qu'un test sur un nom de domaine non délégué ?

source: Parent data fetched with success.
fr: Les données de la zone parente ont été récupérées avec succès.

source: Error during parent data fetching.
fr: Erreur lors de la récupération des données de la zone parente.

source: Program versions
fr: Versions des programmes

source: Zonemaster Backend is not available.
fr: Zonemaster Backend n'est pas disponible.

source: Domain name required
fr: Le nom de domaine est obligatoire

source: Run a test
fr: Lancer un test

source: Disable IPv4
fr: Désactiver IPv4

source: Disable IPv6
fr: Désactiver IPv6

source: Profile
fr: Profil

source: Nameservers
fr: Serveurs de noms

source: Keytag
fr: Identifiant

source: Keytag required
fr: Identifiant obligatoire

source: Algorithm
fr: Algorithme

source: Algorithm required
fr: L'algorithme est obligatoire

source: Digest type
fr: Type de condensat

source: Digest type required
fr: Le type de condensat est obligatoire

source: Digest
fr: Condensat

source: Digest required
fr: Le condensat est obligatoire

source: All
fr: Tous

source: Delegated
fr: Délégués

source: Undelegated
fr: Non délégués

source: Undelegated
fr: Non délégué

source: Results from previous tests are not available.
fr: Les résultats des tests précédents ne sont pas disponibles.

source: Click to return on the top page
fr: Cliquer pour retourner en haut de la page

source: Error 404
fr: Erreur 404

source: Page Not Found
fr: Page introuvable

source: Sorry, there is nothing here!
fr: Désolé, il n'y a rien ici !

source: Result
fr: Résultat

source: History
fr: Historique

source: Export
fr: Exporter

source: Share
fr: Partager

source: All
fr: Tout

source: Notice
fr: Note

source: Warning
fr: Avertissement

source: Error
fr: Erreur

source: Critical
fr: Critique

source: No data for this test.
fr: Il n'y a pas de résultat pour ce test.

source: History information request is in progress.
fr: La demande d'historique est en cours.

source: Level
fr: Sévérité

source: Please set the api endpoint
fr: Merci de contacter l'administrateur, un point d'accès est nécessaire

source: A word about the DNS
fr: À propos du DNS

source: Test completed!
fr: Test terminé !

source: Change language
fr: Changer de langue

source: Name
fr: Lancer

source: Cannot disable both IPv4 and IPv6
fr: Impossible de désactiver IPv4 et IPv6 simultanément

source: No data found for the zone.
fr: Aucune donnée trouvée pour la zone.

source: Fetch DS from parent zone
fr: Récupérer les DS depuis la zone parente

source: Link to test
fr: Lien vers le test

source: General
fr: Général

source: DS records
fr: Enregistrements DS

source: Clear domain input
fr: Effacer le champ du domaine

source: Copy link to clipboard
fr: Copier le lien dans le presse-papiers

source: Protocol
fr: Protocole

source: No previous tests found for this domain.
fr: Aucun test antérieur n’a été trouvé pour ce domaine.

source: An unexpected server error happened.
fr: Une erreur imprévue du serveur est survenue.

# ngb.pagination.first-aria
source: First
fr: Aller au début

# ngb.pagination.last-aria
source: Last
fr: Aller à la fin

# ngb.pagination.next-aria
source: Next
fr: Suivant

# ngb.pagination.previous-aria
source: Previous
fr: Précédent

source: When a domain name is sent to Zonemaster for testing, Zonemaster investigates the state of the domain name from the top to the bottom of the DNS tree. This is usually done by examining DNS data from the root, '.', to the Top-Level Domain (TLD) for that domain name, like '.net', and then finally through the DNS servers that contain authoritative information about the specified domain name.
fr: Lorsqu'un nom de domaine est envoyé à Zonemaster pour être testé, Zonemaster vérifie l'état du nom de domaine de haut vers bas de l'arborescence DNS. Cela est généralement fait en examinant les données DNS depuis la racine, « . » , au domaine de premier niveau (Top-Level Domain, TLD) pour ce nom de domaine, comme « .net », et enfin jusqu'aux serveurs de noms contenant des informations faisant autorité sur le nom de domaine spécifié.

source: More information on undelegated test:
fr: Plus d'information sur les tests non délégués :

source: Reset the form
fr: Réinitialiser le formulaire

source: Delete nameserver #{{i + 1}}
fr: Supprimer le serveur de noms #{{i + 1}}

source: What is Zonemaster?
fr: Qu'est-ce que Zonemaster ?

source: Nameserver #{{ i + 1}}
fr: Serveur de noms #{{ i + 1}}

source: Run the test
fr: Lancer le test

source: The name of nameserver is required
fr: Le nom du serveur de noms est requis

source: Copyright © AFNIC and The Swedish Internet Foundation
fr: Copyright © AFNIC et The Swedish Internet Foundation

source: Delete DS record #{{i + 1}}
fr: Supprimer l'enregistrement DS #{{i + 1}}

source: Check how your domain is doing
fr: Vérifier l'état de votre domaine

source: The Domain Name System (DNS) is a database that associates domain names to Internet Protocol (IP) addresses, the same way a phone book associates names to phone numbers. An IP address is a unique series of numbers that identifies every computer that is connected to the Internet. It is similar to the way every telephone has its own number in the telephone network. Such long series of numbers work fine for computers, but for people it is way more difficult to memorize. Thus, the DNS has been developed as an extra layer to map between names that we can remember better and IP addresses used by computers whenever we want to reach a specific website or use other services on the Internet, like e-mail.
fr: Le Système de Nom de Domaine (DNS) est une base de données qui associe des noms de domaine à des adresses IP (Internet Protocol), de la même manière qu’un annuaire associe des noms à des numéros de téléphone. Une adresse IP est un identifiant numérique unique qui identifie chaque ordinateur connecté à Internet, de la même manière que chaque téléphone a son propre numéro dans le réseau téléphonique. Ces identifiants numériques complexes conviennent parfaitement aux ordinateurs, mais sont beaucoup plus difficiles à mémoriser pour des humains. C’est pour cela que le DNS a été développé, pour établir une correspondance entre des noms que nous pouvons plus facilement retenir et les adresses IP utilisées par les ordinateurs lorsqu’on veut accéder à un site Web ou utiliser d’autres services sur Internet, comme le courriel.

source: Test your domain
fr: Tester votre domaine

source: Collapse all
fr: Replier tout

source: Filter severity levels
fr: Filtrer les niveaux de sévérité

source: Test another domain
fr: Tester un autre domaine

source: Select the digest type
fr: Sélectionner le type de condensat

source: Domain name
fr: Nom de domaine

source: Select the algorithm
fr: Sélectionner l'algorithme

source: DS record #{{ i + 1}}
fr: Enregistrement DS #{{ i + 1}}

source: Does Zonemaster support IPv6?
fr: Zonemaster est-il compatible avec IPv6 ?

source: Can I test the DS records before they are published?
fr: Peut-on tester des enregistrements DS avant leur publication ?

source: What makes Zonemaster different from other DNS zone validating software?
fr: Qu'est-ce qui distingue Zonemaster des autres outils de validation de zone DNS ?

source: To check a reverse zone with Zonemaster, one first needs to know what the reverse zone is, and enter it in the format it has in the DNS. A reserve zone is obtained by reversing an IP address and adding a suffix. IPv4 addresses use the suffix "in-addr.arpa" while IPv6 addresses use "ip6.arpa".
fr: Pour tester une zone inverse, il faut d'abord déterminer le nom de la zone inverse, puis la saisir dans le format qu'elle a dans le DNS. Une zone inverse s'obtient en inversant une adresse IP et en ajoutant un suffixe. Les adresses IPv4 utilisent le suffixe « in-addr.arpa » tandis que les adresses IPv6 utilisent « ip6.arpa ».

source: There are several possibilities.
fr: Il y a plusieurs possibilités.

source: The ambition of the Zonemaster project is to develop and maintain an open source DNS validation tool, offering improved performance over existing tools and providing extensive documentation which could be re-used by similar projects in the future.
fr: L'ambition du projet Zonemaster est de développer et de maintenir un outil de validation DNS open source, offrant des performances améliorées par rapport aux outils existants et fournissant une documentation complète qui pourrait être réutilisée par des projets similaires à l'avenir.

source: Yes. If DNSSEC is available for a domain name that is tested by Zonemaster, it will be checked automatically.
fr: Oui. Si DNSSEC est disponible pour un nom de domaine testé par Zonemaster, ce sera automatiquement vérifié.

source: Zonemaster and privacy
fr: Zonemaster et vie privée

source: <a href="https://github.com/zonemaster/zonemaster-cli">CLI</a>,a command-line interface to the Engine;
fr: <a href="https://github.com/zonemaster/zonemaster-cli">CLI</a>, une interface en ligne de commande à l'Engine ;

source: Nothing besides the test domain, other test parameters and the result is stored in the database. Specifically we do not store any information that could link a test to the user who initiated it.
fr: Rien hormis le domaine du test, les autres paramètres du test et le résultat n'est stocké dans la base de données. En particulier, nous ne stockons aucune information qui pourrait lier un test à la personne qui l'a initié.

source: How can Zonemaster distinguish between what is right and wrong?
fr: Comment Zonemaster discerne-t-il le bon du mauvais ?

source: The components will help different types of users to check domain servers for configuration errors and generate a report that will assist in fixing the errors.
fr: Ces composants aideront différents types d'utilisateurs et utilisatrices à vérifier les erreurs de configuration des serveurs de domaine et à générer un rapport qui aidera à corriger les erreurs.

source: The judgement of Zonemaster is primarily based on the DNS standards as defined in <a i18n-href="RFC Wikipedia link" href="https://en.wikipedia.org/wiki/Request_for_Comments">RFCs</a>. It also bases its judgement on DNS best practices, which can be more loosely defined.
fr: Le jugement de Zonemaster repose principalement sur les normes techniques du DNS telles qu'elles sont définies dans les <a i18n-href="RFC Wikipedia link" href="https://en.wikipedia.org/wiki/Request_for_Comments">RFCs</a>. Le jugement est également fondé sur les bonnes pratiques du DNS, dont la définition est moins stricte. Tous les tests de Zonemaster sont définis dans des spécifications de cas de test, dans lesquels vous pourrez trouver les références aux documents normatifs pour un cas de test donné.

source: This can be quite useful if one is going to migrate one's domain from one registrar to another, for example, migrate zone 'example.com' from the name server 'ns.example.com' to the name server 'ns.example.org'. In this scenario one could perform an undelegated domain test providing the zone ('example.com') and the name server you are migrating to ('ns.example.org') before you migrate your domain. When the results of the test doesn't show any errors or warnings one can be fairly certain that the domain's new location is working well. However there might still be other problems in the zone data itself that this test is unaware of.
fr: Ce type de test peut être très utile lorsqu'on est en train de migrer un domaine d'un bureau d'enregistrement vers un autre, par exemple lorsqu'on migre la zone « example.com » du serveur de noms « ns.example.com » vers le serveur de noms « ns.example.org ». Dans ce cas de figure, on pourrait effectuer un test sur un nom de domaine non délégué, en fournissant la zone (« example.com ») et le serveur de noms vers lequel on migre (« ns.example.org ») avant de migrer le domaine. Si le résultat du test ne comporte aucune erreur ni avertissement, on peut être relativement certain que le nouvel emplacement du domaine fonctionne bien. Mais cela n'exclut pas l'existence d'autres problèmes dans les données elles-mêmes de la zone que ce test n'aurait pas décelés.

source: Zonemaster can be used to test <a href="#">DS records before their publication</a> in the parent zone.
fr: Zonemaster peut être utilisé pour tester des <a href="#">enregistrements DS avant leur publication</a> dans la zone parente.

source: Using Zonemaster
fr: Utilisation de Zonemaster

source: <a href="https://github.com/zonemaster/zonemaster-engine">GUI</a>, a web interface to the Backend.
fr: <a href="https://github.com/zonemaster/zonemaster-engine">GUI</a>, une interface web au Backend.

source: Zonemaster send multiple DNS queries to the name servers hosting the domain name being tested and also to the name servers hosting the parent zone of that domain name.
fr: Zonemaster envoie plusieurs requêtes DNS aux serveurs de noms hébergeant le nom de domaine à tester ainsi qu'aux serveurs de noms hébergeant la zone parente du même nom de domaine.

source: Who is behind Zonemaster?
fr: Qui est derrière Zonemaster ?

source: Users of the second category should contact their DNS operator in case there are errors or warnings for any test of their domain name.
fr: Les utilisateurs et utilisatrices de la seconde catégorie devraient contacter leur opérateur DNS si le moindre test de leur nom de domaine rapporte une erreur ou un avertissement.

source: Your domain name is not reachable from public Internet.
fr: Votre domaine n'est pas joignable publiquement depuis Internet.

source: Frequently asked questions
fr: Questions fréquentes

source: Your domain name is not yet delegated.
fr: Votre domaine n'est pas encore délégué.

source: You can also get further insight about each test from the <a href="https://github.com/zonemaster/zonemaster/tree/master/docs/public/specifications/tests#zonemaster-test-case-specifications">Test Case Specification documents</a>.
fr: Vous pouvez également trouver des détails supplémentaires sur chaque test dans le <a href="https://github.com/zonemaster/zonemaster/tree/master/docs/public/specifications/tests#zonemaster-test-case-specifications">document de spécification des cas de tests (en anglais)</a>.

source: This open source version of Zonemaster was built using modular code which basically means that you can integrate parts of it in your own systems, if you wish. For example, it is quite rare that you would want a complete program just to check for redelegations.
fr: Enfin, cette version « open source » de Zonemaster a été écrite de manière modulaire, ce qui signifie en résumé qu'il est possible d'intégrer des parties de Zonemaster dans vos propres systèmes, si vous le souhaitez. Par exemple, on souhaite rarement utiliser un logiciel complet juste pour vérifier des redélégations.

source: Zonemaster can only test what is called a DNS zone, for example 'zonemaster.net', and not host names, like 'www.zonemaster.net'.
fr: Zonemaster peut seulement tester ce qu'on appelle une zone DNS, par exemple « zonemaster.net », et non pas les noms d'hôte, comme « www.zonemaster.net ».

source: Queries sent can be shown using the 'DEBUG' level option. Fair warning, the output from the CLI can be quite heavy. For more information see <a href="https://github.com/zonemaster/zonemaster/blob/master/docs/public/using/cli.md">CLI usage documentation</a>.
fr: Les requêtes envoyées peuvent être affichées avec l'option de niveau de messages « DEBUG ». Attention, la quantité de données affichées par l'interface en ligne de commande peut être très volumineuse. Pour plus d'informations, voir <a href="https://github.com/zonemaster/zonemaster/blob/master/docs/public/using/cli.md">l'utilisation de l'interface en ligne de commandes (en anglais)</a>.

source: Source code
fr: Code source

source: How can I test a "reverse" zone with Zonemaster?
fr: Comment tester une zone inverse avec Zonemaster ?

source: Find answers to common questions about Zonemaster here.
fr: Trouvez ici les réponses aux questions les plus courantes sur Zonemaster.

source: Zonemaster consists of several modules or components:
fr: Zonemaster est constitué de plusieurs modules ou composants :

source: An undelegated domain test is a test performed on a domain name that may, or may not, be fully published in the DNS.
fr: Un test sur un nom de domaine non délégué est un test effectué sur un nom de domaine qui peut ne pas être entièrement publié dans le DNS.

source: How can Zonemaster help me?
fr: Qu'est-ce que Zonemaster peut faire pour moi ?

source: General information
fr: Informations générales

source: Zonemaster returns "Error" or "Warning" for my domain name. What does it mean?
fr: Zonemaster affiche des « Erreurs » ou « Avertissements » pour mon nom de domaine. Qu'est-ce que cela signifie ?

source: <a href="https://github.com/zonemaster/zonemaster-backend">Bakend</a>, a server that allows you to run Zonemaster tests and save results using a JSON-RPC API and a database;
fr: <a href="https://github.com/zonemaster/zonemaster-backend">Bakend</a>, un serveur permettant l'exécution de tests et la sauvegarde de résultats au moyen d'une API JSON-RPC et d'une base de données ;

source: What is Zonemaster?
fr: Qu'est-ce que Zonemaster ?

source: DNS operators, experts and beginners alike, who want to check their DNS configuration;
fr: Administrateurs et administratrices DNS, expertes comme débutants, qui veulent vérifier leur configuration DNS ;

source: All Zonemaster tests are defined in the <a href="https://github.com/zonemaster/zonemaster/tree/master/docs/public/specifications/tests#zonemaster-test-case-specifications">Test Case Specification documents</a> in which the references to the standard documents for that test case are found.
fr: Tous les tests de Zonemaster sont définis dans les <a href="https://github.com/zonemaster/zonemaster/tree/master/docs/public/specifications/tests#zonemaster-test-case-specifications">documents de spécifications de cas de test (en anglais)</a>, dans lesquels vous pourrez trouver les références aux documents normatifs pour chaque cas de test.

source: <strong>Zonemaster performs many tests</strong>, such as checking DNSSEC signatures, or that different hosts can be accessed and that IP addresses are valid. This is all to make sure that your domain name runs as smoothly as possible.
fr: <strong>Zonemaster réalise plusieurs tests</strong>, tels que la vérification des signatures DNSSEC, ou que les différents serveurs sont accessibles et que les adresses IP sont valides. Tout cela pour s’assurer que votre nom de domaine fonctionne aussi bien que possible.

source: The web interface of Zonemaster does not show the queries that were sent, only the CLI interface can. If you want to see such queries, you will have to locally install a minimally working Zonemaster instance with both the Engine and CLI components. See the <a href="https://github.com/zonemaster/zonemaster/blob/master/docs/public/installation/zonemaster-cli.md">CLI installation document</a> for more information, or if you prefer a <a href="https://github.com/zonemaster/zonemaster/blob/master/docs/public/using/cli.md#Invoking-the-command-line-tool-using-Docker">Docker image</a> is also available.
fr: L'interface web de Zonemaster n'affiche pas les requêtes envoyées, seule l'interface en ligne de commande en est capable. Si vous souhaitez voir ces requêtes, vous devez installer localement une instance minimale et fonctionnelle de Zonemaster dotée des composants Engine et CLI. Référez-vous au <a href="https://github.com/zonemaster/zonemaster/blob/master/docs/public/installation/zonemaster-cli.md">document d'installation de la CLI (en anglais)</a> pour plus d'information, ou si vous préférer, une <a href="https://github.com/zonemaster/zonemaster/blob/master/docs/public/using/cli.md#Invoking-the-command-line-tool-using-Docker">image Docker</a> est aussi disponible.

source: Sometimes there are different interpretations of the standards or opinions on what is best practice, and the Zonemaster team is always open to input. If you think we have made a mistake in our judgement please do not hesitate to send us an email at <a href="mailto:zonemaster-users@lists.iis.se">zonemaster-users@lists.iis.se</a> (moderated mailing list) with a link to your test result and an explanation as to why you think it shows something that you consider incorrect.
fr: Parfois, les normes techniques ou les opinions de ce qui constitue une bonne pratique peuvent faire l'objet d'interprétations multiples ; l'équipe de Zonemaster est toujours ouverte aux commentaires. Si vous pensez que nous avons fait une erreur dans notre jugement, n'hésitez pas à nous envoyer un courriel à <a href="mailto:zonemaster-users@lists.iis.se">zonemaster-users@lists.iis.se</a> (liste de diffusion modérée) avec un lien vers le résultat de votre test et en expliquant pourquoi vous pensez que Zonemaster affiche quelque chose que vous considérez comme incorrect.

source: Does Zonemaster verify DNSSEC?
fr: Zonemaster vérifie-t-il DNSSEC ?

source: users who want to know whether the domain name they own or use have any issues or not.
fr: les utilisateurs et utilisatrices souhaitant savoir si les noms de domaine qu'ils possèdent ou utilisent ont des problèmes.

source: You have misspelled your domain name.
fr: Vous avez fait une faute de frappe dans le nom de domaine.

source: Give your domain name a complete checkup! <strong>Zonemaster helps you assess how your domain name is doing.</strong>
fr: Donnez à votre nom de domaine un examen complet ! <strong>Zonemaster vous aide à évaluer l’état de votre nom de domaine.</strong>

source: What kind of DNS queries does Zonemaster generate?
fr: Quel genre de requêtes Zonemaster génère-t-il ?

source: However, since <a href="https://zonemaster.net">zonemaster.net</a>, like other public instances, is open to everyone, it is possible for anyone to test your domain and view its history of tests.
fr: Toutefois, comme <a href="https://zonemaster.net">zonemaster.net</a>, comme d'autre instances publiques, est accessible à tout le monde, n'importe qui peut tester votre domaine et consulter son historique de tests.

source: Zonemaster saves all history from earlier tests based on the tested domain name, which means you can go back to a test you did some time ago and compare it to the test you ran just a moment ago.
fr: Zonemaster conserve tout l'historique des tests réalisés sur un nom de domaine, ce qui signifie que vous pouvez revenir en arrière pour comparer les résultats d'un test remontant à un certain temps et ceux d'un test que vous avez lancé il y a juste un instant.

source: You still don't find the information you are looking for?<br> You can contact the Zonemaster project team using the <a href="https://lists.iis.se/postorius/lists/zonemaster-users.lists.iis.se">user mailing list</a>, <a href="https://github.com/zonemaster/zonemaster/issues">the issue tracker</a> or <a href="mailto:zonemaster@zonemaster.net.">the contact e-mail address</a>.
fr: Vous ne trouvez pas l'information que vous cherchez ?<br> Vous pouvez contacter l'équipe du projet Zonemaster en utilisant <a href="https://lists.iis.se/postorius/lists/zonemaster-users.lists.iis.se">la liste de diffusion pour les utilisateurs et utilisatrices</a>, <a href="https://github.com/zonemaster/zonemaster/issues">le gestionnaire de tickets</a> ou <a href="mailto:zonemaster@zonemaster.net.">l'adresse de couriel de contact</a>.

source: <a href="https://github.com/zonemaster/zonemaster-engine">Engine</a>, a test framework that supports all functionality to perform DNS tests;
fr: <a href="https://github.com/zonemaster/zonemaster-engine">Engine</a>, un cadriciel de tests prenant en charge toutes les fonctionnalités pour les tests DNS ;
